my_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5] #переменной присваиваем список чисел
index = 0                                              #Начинаем переберать числа с 0
while index < len(my_list):                            #Пока index больше кол-ва цифр выполняется условие

    if my_list[index] < 0:                             #если числи меньше 0 то останавливаем
        break

    if my_list[index] > 0:                             #если число больше 0
        print(my_list[index])                          #выводим на экран
    index = index + 1  